# GetSectionByNumber Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystem..::..GetSectionByNumber Method
MEPSystem Class See Also
---
Get the Section from section number
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public MEPSection GetSectionByNumber(
	int sectionNumber
)
```

Visual Basic
---
```text
Public Function GetSectionByNumber ( _
	sectionNumber As Integer _
) As MEPSection
```

Visual C++
---
```text
public:
MEPSection^ GetSectionByNumber(
	int sectionNumber
)
```

# ### Parameters
sectionNumber
    Type: System..::..Int32 The Section number.
# ### Return Value
The section. nullNothingnullptra null reference (Nothing in Visual Basic) if the no section exists for the input section number.
# See Also
MEPSystem Class
Autodesk.Revit.DB Namespace